Repository: 12089630012005/farmer_updated
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi

source: FarmSupport Pro
hi: फार्म सपोर्ट प्रो

source: Home
hi: होम

source: Farmers
hi: किसान

source: Crops
hi: फसलें

source: Queries
hi: प्रश्न

source: Equipment
hi: उपकरण

source: Lending
hi: उधार देना

source: Reviews
hi: समीक्षाएं

source: Login
hi: लॉगिन करें

source: Grow Better. Together.
hi: बेहतर बढ़ें। साथ मिलकर।

source: Knowledge, equipment, and support for every farmer — all in one place.
hi: हर किसान के लिए ज्ञान, उपकरण और समर्थन - सब एक जगह।

source: Join Community
hi: समुदाय में शामिल हों

source: Ask a Query
hi: प्रश्न पूछें

source: Farmers Community
hi: किसान समुदाय

source: 🔍 Search farmers...
hi: 🔍 किसानों को खोजें...

source: All Locations
hi: सभी स्थान

source: Crop Types
hi: फसल के प्रकार

source: Add New Crop Type
hi: नई फसल प्रकार जोड़ें

source: Crop Name
hi: फसल का नाम

source: Category
hi: श्रेणी

source: Select Category
hi: श्रेणी चुनें

source: Grains
hi: अनाज

source: Vegetables
hi: सब्जियां

source: Fruits
hi: फल

source: Legumes
hi: दालें

source: Pulses
hi: दलहन

source: Cash Crops
hi: नकदी फसलें

source: Oilseeds
hi: तिलहन

source: Spices
hi: मसाले

source: Flowers
hi: फूल

source: Fiber
hi: रेशा

source: Plantation
hi: बागान

source: Medicinal
hi: औषधीय

source: Fodder
hi: चारा

source: Add Crop
hi: फसल जोड़ें

source: Farmer Queries
hi: किसान के प्रश्न

source: Post New Query
hi: नया प्रश्न पोस्ट करें

source: Title
hi: शीर्षक

source: Crop Type
hi: फसल का प्रकार

source: Select Crop
hi: फसल चुनें

source: Description
hi: विवरण

source: Image
hi: छवि

source: Post Query
hi: प्रश्न पोस्ट करें

source: Search queries...
hi: प्रश्न खोजें...

source: All Crops
hi: सभी फसलें

source: Add New Equipment
hi: नया उपकरण जोड़ें

source: Equipment Name
hi: उपकरण का नाम

source: Type
hi: प्रकार

source: Select Type
hi: प्रकार चुनें

source: Tractor
hi: ट्रैक्टर

source: Harvester
hi: कटाई मशीन

source: Plough
hi: हल

source: Sprayer
hi: छिड़काव यंत्र

source: Thresher
hi: थ्रेशर

source: Cultivator
hi: कल्टीवेटर

source: Seeder
hi: बीज बोने की मशीन

source: Rotavator
hi: रोटावेटर

source: Irrigation Pump
hi: सिंचाई पंप

source: Trailer
hi: ट्रेलर

source: Baler
hi: गांठ बनाने की मशीन

source: Combine
hi: कंबाइन

source: Power Tiller
hi: पावर टिलर

source: Drone Sprayer
hi: ड्रोन स्प्रेयर

source: Weeder
hi: खरपतवार निकालने की मशीन

source: Sprinkler
hi: फव्वारा

source: Condition
hi: स्थिति

source: Select Condition
hi: स्थिति चुनें

source: Excellent
hi: उत्कृष्ट

source: Good
hi: अच्छा

source: Fair
hi: ठीक है

source: Hourly Rate (₹)
hi: प्रति घंटा दर (₹)

source: Availability
hi: उपलब्धता

source: Available
hi: उपलब्ध

source: Unavailable
hi: अनुपलब्ध

source: Add Equipment
hi: उपकरण जोड़ें

source: Search equipment...
hi: उपकरण खोजें...

source: All Types
hi: सभी प्रकार

source: My Equipment
hi: मेरे उपकरण

source: Available from Others
hi: दूसरों से उपलब्ध

source: Login / Profile
hi: लॉगिन / प्रोफाइल

source: Sign In or Create Account
hi: साइन इन करें या खाता बनाएं

source: Email
hi: ईमेल

source: Password
hi: पासवर्ड

source: Sign Up
hi: साइन अप करें

source: Your Profile
hi: आपकी प्रोफाइल

source: Name
hi: नाम

source: Location
hi: स्थान

source: Phone
hi: फोन

source: Language
hi: भाषा

source: Select Language
hi: भाषा चुनें

source: Field Size (acres)
hi: खेत का आकार (एकड़)

source: Save Profile
hi: प्रोफाइल सहेजें

source: Logout
hi: लॉगआउट

source: Saved Details
hi: सहेजे गए विवरण

source: Equipment Lending
hi: उपकरण उधार

source: Request Equipment
hi: उपकरण का अनुरोध करें

source: Select Equipment
hi: उपकरण चुनें

source: Borrower
hi: उधारकर्ता

source: Auto-set to your account
hi: आपके खाते में स्वचालित रूप से सेट

source: Start Date
hi: प्रारंभ तिथि

source: Duration (days)
hi: अवधि (दिन)

source: Submit Request
hi: अनुरोध सबमिट करें

source: My Requests (Borrowing)
hi: मेरे अनुरोध (उधार लेना)

source: No requests yet.
hi: अभी तक कोई अनुरोध नहीं।

source: Requests for My Equipment (Lending)
hi: मेरे उपकरणों के लिए अनुरोध (उधार देना)

source: Reviews & Feedback
hi: समीक्षा और प्रतिक्रिया

source: Add Review
hi: समीक्षा जोड़ें

source: From (Reviewer)
hi: से (समीक्षक)

source: To (Review Target)
hi: को (समीक्षा लक्ष्य)

source: Select Farmer
hi: किसान चुनें

source: Farmer
hi: किसान

source: Rating
hi: रेटिंग

source: Feedback
hi: प्रतिक्रिया

source: Submit Review
hi: समीक्षा सबमिट करें

source: Voice Query
hi: आवाज़ प्रश्न

source: Start Recording
hi: रिकॉर्डिंग शुरू करें

source: Clear
hi: साफ़ करें

source: Click the microphone to record your query in your preferred language
hi: अपनी पसंदीदा भाषा में प्रश्न रिकॉर्ड करने के लिए माइक्रोफोन पर क्लिक करें

source: Enter your name in your preferred language
hi: अपनी पसंदीदा भाषा में अपना नाम दर्ज करें

source: Enter your location in your preferred language
hi: अपनी पसंदीदा भाषा में अपना स्थान दर्ज करें

source: Describe your query in your preferred language
hi: अपनी पसंदीदा भाषा में अपना प्रश्न वर्णन करें

source: Enter query title in your preferred language
hi: अपनी पसंदीदा भाषा में प्रश्न शीर्षक दर्ज करें
